IF (NOT EXISTS (SELECT * FROM Cities))
  INSERT INTO Cities(id, name) VALUES
  (1, 'Москва'),
  (2, 'Санкт-Петербург'),
  (3, 'Ярославль')

IF (NOT EXISTS (SELECT * FROM Streets))
  INSERT INTO Streets(id, name, city_id) VALUES
-- Москва
  (1, 'Никольская', 1),
  (2, 'Большая Дмитровка', 1),
  (3, 'Кузнецкий Мост', 1),
-- Питер
  (4, 'Пушкинская', 2),
  (5, 'Гончарная', 2),
-- Ярик
  (6, 'Свободы', 3),
  (7, 'Депутатская', 3)

IF (NOT EXISTS (SELECT * FROM Houses))
  INSERT INTO Houses(id, number, street_id) VALUES
-- Москва Никольская
  (1, '3', 1),
  (2, '4/5', 1),
  (3, '10', 1),
-- Москва Большая Дмитровка
  (4, '1', 2),
  (5, '4/2', 2),
  (6, '4', 2),
-- Москва Кузнецктй Мост
  (7, '2', 3),
  (8, '3', 3),
-- Питер Пушкинская
  (9, '2A', 4),
  (10, '3', 4),
-- Питер Гончарная
  (11, '7', 5),
  (12, '8', 5),
-- Ярик Свободы
  (13, '1/2', 6),
  (14, '2/40', 6),
  (15, '10A', 6),
-- Ярик Депутатская
  (16, '1', 7),
  (17, '2', 7),
  (18, '3', 7),
  (19, '4', 7)

IF (NOT EXISTS (SELECT * FROM Apartments))
  INSERT INTO Apartments(id, area, house_id) VALUES
-- Москва Никольская 1
  (1, 30.00, 1),
  (2, 45.50, 1),
  (3, 60.00, 1),
-- 2
  (4, 30.00, 2),
  (5, 45.50, 2),
  (6, 60.00, 2),
-- 3
  (7, 30.00, 3),
  (8, 45.50, 3),
  (9, 60.00, 3),
-- Москва БД 1
  (10, 30.00, 4),
  (11, 45.50, 4),
  (12, 60.00, 4),
-- 2
  (13, 30.00, 5),
  (14, 45.50, 5),
  (15, 60.00, 5),
-- 3
  (16, 30.00, 6),
  (17, 45.50, 6),
  (18, 60.00, 6),
-- Москва КМ 1
  (19, 30.00, 7),
  (20, 45.50, 7),
  (21, 60.00, 7),
-- 2
  (22, 30.00, 8),
  (23, 45.50, 8),
  (24, 60.00, 8),
-- Питер Пушкинская 1
  (25, 30.00, 9),
  (26, 45.50, 9),
  (27, 60.00, 9),
-- 2
  (28, 30.00, 10),
  (29, 45.50, 10),
  (30, 60.00, 10),
-- Питер Гончарная 1
  (31, 30.00, 11),
  (32, 45.50, 11),
  (33, 60.00, 11),
-- 2
  (34, 30.00, 12),
  (35, 45.50, 12),
  (36, 60.00, 12),
-- Ярик Свободы 1
  (37, 30.00, 13),
  (38, 45.50, 13),
  (39, 60.00, 13),
-- 2
  (40, 30.00, 14),
  (41, 45.50, 14),
  (42, 60.00, 14),
-- 3
  (43, 30.00, 15),
  (44, 45.50, 15),
  (45, 60.00, 15),
-- Ярик Депутатская 1
  (46, 30.00, 16),
  (47, 45.50, 16),
  (48, 60.00, 16),
-- 2
  (49, 30.00, 17),
  (50, 45.50, 17),
  (51, 60.00, 17),
-- 3
  (52, 30.00, 18),
  (53, 45.50, 18),
  (54, 60.00, 18),
-- 4
  (55, 30.00, 19),
  (56, 45.50, 19),
  (57, 60.00, 19)
